---
kind: method
id: M:Autodesk.Revit.DB.DatumPlane.Maximize3DExtents
source: html/231447e9-0963-fe1d-8177-d8ac136f835d.htm
---
# Autodesk.Revit.DB.DatumPlane.Maximize3DExtents Method

Computes the 3d extents of all model geometry and levels, and extends the 3d extents of this datum surface to include the model extents.

## Syntax (C#)
```csharp
public void Maximize3DExtents()
```

## Remarks
Currently does not apply to curved grids.